{
  "architectures": [
    "Qwen3_5MoeForConditionalGeneration"
  ],
  "model_type": "qwen3_5_moe",
  "torch_dtype": "bfloat16",
  "num_hidden_layers": 64,
  "quantization_config": {
    "quant_method": "ascend"
  }
}